_Rarzrabotki/Rarus/USO2/InformationRegisters/уатЭкипажТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>уатЭкипажТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧленЭкипажа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатЧленыЭкипажа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>Транспортное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/уатЭкипажТС/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОрганизация = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.ТекущийПользователь(), "ОсновнаяОрганизация");
	
	Если Не ЗначениеЗаполнено(Запись.Сотрудник) И Параметры.Свойство("Сотрудник") Тогда
		Запись.Сотрудник = Параметры.Сотрудник;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Запись.ТС) И Параметры.Свойство("ТС") Тогда
		Запись.ТС = Параметры.ТС;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТС",          Запись.ТС);
	Запрос.УстановитьПараметр("ЧленЭкипажа", Запись.ЧленЭкипажа);
	Запрос.УстановитьПараметр("Сотрудник",   Запись.Сотрудник);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	уатЭкипажТС.ТС КАК ТС
	|ИЗ
	|	РегистрСведений.уатЭкипажТС КАК уатЭкипажТС
	|ГДЕ
	|	уатЭкипажТС.ТС = &ТС
	|	И уатЭкипажТС.ЧленЭкипажа = &ЧленЭкипажа
	|	И уатЭкипажТС.Сотрудник <> &Сотрудник";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ТекстНСТР = НСтр("en='For vehicle ""%1"" a member of crew ""%2"" has been chosen already.';ru='Для ТС ""%1"" член экипажа ""%2"" уже был выбран.'");
		ТекстОшибки = СтрШаблон(ТекстНСТР, Запись.ТС, Запись.ЧленЭкипажа);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура ТСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("уатОрганизация", ТекОрганизация);
	уатИнтерфейсВводаТС.РеквизитТСНачалоВыбора(Элемент, Запись.ТС, ДанныеВыбора, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("уатОрганизация", ТекОрганизация);
	уатИнтерфейсВводаТС.РеквизитТСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура ТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	СтруктураОтбор = Новый Структура("уатОрганизация", ТекОрганизация);
	уатИнтерфейсВводаТС.РеквизитТСОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка, СтруктураОтбор);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ТС) Тогда
		ОргСотрудника = уатОбщегоНазначения.МестонахождениеТС(Запись.ТС, ТекущаяДата()).Организация;
	Иначе
		ОргСотрудника = ТекОрганизация;
	КонецЕсли;
	уатЗащищенныеФункцииКлиент.ДиалогВыбораСотрудника(Элемент, Запись.Сотрудник, Новый Структура("Организация", ОргСотрудника), СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОткрытие(Элемент, СтандартнаяОбработка)
	уатЗащищенныеФункцииКлиент.ОткрытьФормуСотрудника(Запись.Сотрудник, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Ожидание = 0 Тогда //выбор из списка
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ТС) Тогда
		ОргСотрудника = уатОбщегоНазначения.МестонахождениеТС(Запись.ТС, ТекущаяДата()).Организация;
	Иначе
		ОргСотрудника = ТекОрганизация;
	КонецЕсли;
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", ОргСотрудника, ТекущаяДата());
	уатИнтерфейсВводаСотрудников.СотрудникАвтоПодборТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ТС) Тогда
		ОргСотрудника = уатОбщегоНазначения.МестонахождениеТС(Запись.ТС, ТекущаяДата()).Организация;
	Иначе
		ОргСотрудника = ТекОрганизация;
	КонецЕсли;
	СтруктураПараметров = Новый Структура("Организация, ДатаСреза", ОргСотрудника, ТекущаяДата());
	уатИнтерфейсВводаСотрудников.СотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, СтруктураПараметров);
КонецПроцедуры

#КонецОбласти
